In [2]:
import pandas as pd
import numpy as np

In [5]:
obj1=pd.Series([1,2,3,4,5])

In [6]:
obj1.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
obj2=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])

In [8]:
obj2

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [10]:
obj2['a']

1

In [11]:
obj2[['a','d','e']]

a    1
d    4
e    5
dtype: int64

In [18]:
#辞書型のデータに対してSeries化する
data={'mango':100,'orange':900,'apple':300}
obj3=pd.Series(data)
print(obj3)
print('========')
#結果のインデックスはアルファベット順に勝手にソートされてしまう。変えるには明示的にインデックスを指定する必要がある。
index=['mango','orange','apple','grape']
obj3=pd.Series(data,index=index)
print(obj3)

apple     300
mango     100
orange    900
dtype: int64
========
mango     100.0
orange    900.0
apple     300.0
grape       NaN
dtype: float64

In [20]:
obj3.isnull()

mango     False
orange    False
apple     False
grape      True
dtype: bool

In [21]:
# DataFrameを自分で定義する場合の書き方
df1=pd.DataFrame(
    {'name':['John','Micheal','Elly','Ben'],
     'age':[18,23,17,20],
    'sex':['male','male','Female','male']
    }
)

In [22]:
df1

   age     name     sex
0   18     John    male
1   23  Micheal    male
2   17     Elly  Female
3   20      Ben    male

In [30]:
# DataFrameを自分で定義する場合の書き方
df2=pd.DataFrame(
    {'name':['John','Micheal','Elly','Ben'],
     'age':[18,23,17,20],
    'sex':['male','male','Female','male']
    },
    columns=['name','age','sex'],
    index=['a','b',3,4] # stringとintが共存できる。
)

df2

      name  age     sex
a     John   18    male
b  Micheal   23    male
3     Elly   17  Female
4      Ben   20    male

In [23]:
df = pd.DataFrame(
    {'名前': {1:'山田', 2:'鈴木', 3:'佐藤', 4:'田中', 5:'斉藤'},
     '年齢': np.array([20, 34, 50, 12, 62]),
     '性別': pd.Series(['男', '男', '女', '男', '女'])},
    columns=['名前', '性別', '年齢'],      # 順番の指定
    index=[1,2,3,4,5]                            # インデックスの指定
)

df

   名前   性別  年齢
1  山田    男  20
2  鈴木    女  34
3  佐藤    男  50
4  田中    女  12
5  斉藤  NaN  62

In [32]:
data=pd.DataFrame(
    {
        'country':['America','Sobiet','Japan','Germany','Italy','Hungary','Porland','Australia','Checo','England'],
        'sum':[90, 96, 29, 50, 27, 22, 23, 18, 14, 18],
        'gold':[36, 30, 16, 10, 10, 10, 7, 6, 5, 4],
        'silver':[26, 31, 5, 22, 10, 7, 6,2, 6, 12],
        'brond':[28, 35, 8, 18, 7, 5, 10, 10, 3, 2],
        'rank':[1,2,3,4,5,6,7,8,9,10]
    }
)

In [33]:
data

   brond    country  gold  rank  silver  sum
0     28    America    36     1      26   90
1     35     Sobiet    30     2      31   96
2      8      Japan    16     3       5   29
3     18    Germany    10     4      22   50
4      7      Italy    10     5      10   27
5      5    Hungary    10     6       7   22
6     10    Porland     7     7       6   23
7     10  Australia     6     8       2   18
8      3      Checo     5     9       6   14
9      2    England     4    10      12   18

In [48]:
data2=pd.DataFrame(data,columns=['country','sum','gold','silver','brond'])
data2.index=[1,2,3,4,5,6,7,8,9,10]

In [49]:
data2

      country  sum  gold  silver  brond
1     America   90    36      26     28
2      Sobiet   96    30      31     35
3       Japan   29    16       5      8
4     Germany   50    10      22     18
5       Italy   27    10      10      7
6     Hungary   22    10       7      5
7     Porland   23     7       6     10
8   Australia   18     6       2     10
9       Checo   14     5       6      3
10    England   18     4      12      2

In [50]:
data2.iloc[3]

country    Germany
sum             50
gold            10
silver          22
brond           18
Name: 4, dtype: object

In [51]:
data2.head()

   country  sum  gold  silver  brond
1  America   90    36      26     28
2   Sobiet   96    30      31     35
3    Japan   29    16       5      8
4  Germany   50    10      22     18
5    Italy   27    10      10      7

In [52]:
data2.head(5)

   country  sum  gold  silver  brond
1  America   90    36      26     28
2   Sobiet   96    30      31     35
3    Japan   29    16       5      8
4  Germany   50    10      22     18
5    Italy   27    10      10      7

In [81]:
data3=pd.DataFrame(data,columns=['country','sum','gold','silver','brond','unko'])

In [82]:
data3['unko']=np.arange(10)
data3.index=[1,2,3,4,5,6,7,8,9,10]

In [83]:
data3

      country  sum  gold  silver  brond  unko
1     America   90    36      26     28     0
2      Sobiet   96    30      31     35     1
3       Japan   29    16       5      8     2
4     Germany   50    10      22     18     3
5       Italy   27    10      10      7     4
6     Hungary   22    10       7      5     5
7     Porland   23     7       6     10     6
8   Australia   18     6       2     10     7
9       Checo   14     5       6      3     8
10    England   18     4      12      2     9

In [84]:
del data3['unko']
data3

      country  sum  gold  silver  brond
1     America   90    36      26     28
2      Sobiet   96    30      31     35
3       Japan   29    16       5      8
4     Germany   50    10      22     18
5       Italy   27    10      10      7
6     Hungary   22    10       7      5
7     Porland   23     7       6     10
8   Australia   18     6       2     10
9       Checo   14     5       6      3
10    England   18     4      12      2

In [85]:
data3.drop(3,axis=0)

      country  sum  gold  silver  brond
1     America   90    36      26     28
2      Sobiet   96    30      31     35
4     Germany   50    10      22     18
5       Italy   27    10      10      7
6     Hungary   22    10       7      5
7     Porland   23     7       6     10
8   Australia   18     6       2     10
9       Checo   14     5       6      3
10    England   18     4      12      2

In [86]:
data3.drop('sum',axis=1)
#列の削除はdrop axis=1かdel

      country  gold  silver  brond
1     America    36      26     28
2      Sobiet    30      31     35
3       Japan    16       5      8
4     Germany    10      22     18
5       Italy    10      10      7
6     Hungary    10       7      5
7     Porland     7       6     10
8   Australia     6       2     10
9       Checo     5       6      3
10    England     4      12      2

In [88]:
data3.iloc[0:6,:]

   country  sum  gold  silver  brond
1  America   90    36      26     28
2   Sobiet   96    30      31     35
3    Japan   29    16       5      8
4  Germany   50    10      22     18
5    Italy   27    10      10      7
6  Hungary   22    10       7      5

In [90]:
data3.iloc[:5,:2] #indexは表示上１からスタートしているが、プログラム的には0からスタートしているので:5は０~4を意味する。

   country  sum
1  America   90
2   Sobiet   96
3    Japan   29
4  Germany   50
5    Italy   27